Revit 2027 API
BuiltInFailures.MacroFailures.DuplicateModuleName Property
 Macro project with name [MacroModuleName] duplicates with central file. Delete the macro project or re-create it with another name to proceed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuplicateModuleName { get; }
Public Shared ReadOnly Property DuplicateModuleName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuplicateModuleName {
	FailureDefinitionId^ get ();
}
static member DuplicateModuleName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MacroFailures Class
Autodesk.Revit.DB Namespace